"Вариант 3"
"1. Дано целое число A. Проверить истинность высказывания: «Число A является"
"четным»."
"2. Размер скидки на продукты определен следующим образом: при покупке до 500 р."
"скидка составит 2%; при покупке от 500 р. до 1000 р. скидка составит 3%; при"
"покупке от 1000 р. до 1500 р. скидка составит 4%; при покупке от 1500 р. до 2000 р."
"скидка составит 5%. Составить программу определяющую размер скидки в"
"зависимости от потраченной суммы."

while True:
    try:
      A=int (input())
      break
    except ValueError:
        print ("Введите целое число")

if A<500:
    b=(A*2)//100
    c=A-b
    print("скидка 2%: ", c)

if 500<A<1000:
    print("скидка 3%: ")

if 1000<A<1500:
    print("скидка 4%: ")

if 1500<A<2000:
    print("скидка 5%: ")

if 2000<A:
    print("скидка 5%: ")